snlkuharlocal/src/Documents/ДвижениеТовараВнешнегоКонтрагента/ДвижениеТовараВнешнегоКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеТовараВнешнегоКонтрагента</name>
  <registerRecords>AccumulationRegister.ОстаткиТМЦВнешние</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательКонтрагента</name>
    <type>
      <types>CatalogRef.ВнешниеКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейПродаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчитыватьТоварыВПутиСУчетомАвизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУвеличения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокКонтрагента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоставки</name>
      <type>
        <types>EnumRef.СпособПоставкиКонтрагенту</types>
      </type>
    </attributes>
    <attributes>
      <name>НедостающееКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПути</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОтгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПаллеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБрендаДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстатокВДнях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейПродажИзФайла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоробокКОтгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыделятьВДокументах</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяМатрица</name>
      <type>
        <types>DocumentRef.Матрица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОборачиваемостьВДнях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовараДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыВПути</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РНКПути</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/СтатусыЗаявокНаПерепаковку/СтатусыЗаявокНаПерепаковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПерепаковку</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученаСкладом</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоНаПерепаковку</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяУПартнёров</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ДвижениеТовараВнешнегоКонтрагента/ManagerModule.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////
///////// НОВЫЙ АЛГОРИТМ /////////////////////////////////////////////////////////////////////////////

Функция СоздатьЗаявкуНаПерепаковкуНаСпособПоставки(ДокОснование, ЗапросКЗагрузке, Склад, Комментарий = "") Экспорт
	
	ДокОбъект = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокОснование, "ЗаявкаНаПерепаковку",,,Истина);
	
	ДокОбъект.ДокОснование = ДокОснование;
	ДокОбъект.Склад = Склад;
	ДокОбъект.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.ВРаботе;
	ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
	ДокОбъект.Комментарий = ?(СокрЛП(Комментарий) <> "", СокрЛП(Комментарий), "Создано на основании " + Строка(ДокОснование));
	
	ДокСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокОбъект, ЗапросКЗагрузке);
	
	Возврат ?(ДокСсылка = Неопределено, Неопределено, ДокСсылка);
	
КонецФункции

Функция СоздатьЗаявкуНаПерепаковкуНаСпособПоставки_Ф1(ДокОснование, ВыборкаНоменклатуры, Склад, Комментарий = "", ЕстьРаздел = Ложь, ЛимПоз = 10000000) Экспорт
	
	СчтКол = ?(ЕстьРаздел, ЛимПоз, 10000000);
	
	МассивДокументов = Новый Массив;	
	
	КоличествоНоменклатуры = ВыборкаНоменклатуры.Количество();
	
	ТекущаяПозиция = 0;
	Пока Истина Цикл
		
		ДокОбъект = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокОснование, "ЗаявкаНаПерепаковку",,,Истина);
	
		ДокОбъект.ДокОснование = ДокОснование;
		ДокОбъект.Склад = Склад;
		ДокОбъект.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.ВРаботе;
		ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъект.Комментарий = ?(СокрЛП(Комментарий) <> "", СокрЛП(Комментарий), "Создано на основании " + Строка(ДокОснование));
		
		ДокОбъект.Товары.Очистить();
		ДокОбъект.Комплектующие.Очистить();
		
		ВыборкаНоменклатуры.Сбросить();
		
		Счетчик = 0; ТекКол=0;
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			Если Счетчик >= ТекущаяПозиция Тогда
				
				//////// ЗАПОЛНИМ НОМЕНКЛАТУРУ ////////////////////////////////////////////
				ЗаполнитьЗначенияСвойств(ДокОбъект.Товары.Добавить(), ВыборкаНоменклатуры);
				
				//////// ЗАПОЛНИМ КОМПЛЕКТУЮЩИЕ ///////////////////////////////////////////
				Если ВыборкаНоменклатуры.Номенклатура.Коплектующие.Количество() > 0 Тогда
					
					ТЗКомплекта = ВыборкаНоменклатуры.Номенклатура.Коплектующие.Выгрузить();
					// комплект
					Для Каждого СтрокаКомплекта ИЗ ТЗКомплекта Цикл
					
						Если СтрокаКомплекта.Количество = 0 Тогда 
							Продолжить; 
						КонецЕсли; 
					
						НоваяСтрока = ДокОбъект.Комплектующие.Добавить();
						НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
						НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * ВыборкаНоменклатуры.Количество;
						НоваяСтрока.Продукция = ВыборкаНоменклатуры.Номенклатура;
						НоваяСтрока.КоличествоПродукции = ВыборкаНоменклатуры.Количество;
					
					КонецЦикла;
					
					ТекКол = ТекКол + ВыборкаНоменклатуры.Количество * ТЗКомплекта.Итог("Количество");
				Иначе
					// обычный товар
					НоваяСтрока = ДокОбъект.Комплектующие.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНоменклатуры);
					НоваяСтрока.Продукция = ВыборкаНоменклатуры.Номенклатура;
					НоваяСтрока.КоличествоПродукции = ВыборкаНоменклатуры.Количество;
					
					ТекКол = ТекКол + ВыборкаНоменклатуры.Количество;
				КонецЕсли;
				
				ТекущаяПозиция = ТекущаяПозиция + 1;
			КонецЕсли;
			
			Если ТекКол > СчтКол Тогда
				Прервать;
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		// Шворобей ВЮ 29.11.2022 ++
		ДокОбъект.ПостобработкаКомплектующих();
		// Шворобей ВЮ 29.11.2022 ++
		
		Если ДокОбъект.Товары.Количество() > 0 Тогда
			
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				СообщитьИзМодуля("" + ДокОбъект);
				МассивДокументов.Добавить(ДокОбъект.Ссылка);
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Если ТекущаяПозиция >= КоличествоНоменклатуры Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ЗаполнитьЗаявкуНаПерепаковку(ДокОбъект, ВыборкаНоменклатуры) Экспорт
	
	Если ВыборкаНоменклатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДокОбъект <> Неопределено Тогда
		
		Попытка
			ДокОбъект.Заблокировать();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		ДокОбъект.Товары.Очистить();
		ДокОбъект.Комплектующие.Очистить();
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ДокОбъект.Товары.Добавить(), ВыборкаНоменклатуры);
			
			Если ВыборкаНоменклатуры.Номенклатура.Коплектующие.Количество() > 0 Тогда
				
				ТЗКомплекта = ВыборкаНоменклатуры.Номенклатура.Коплектующие.Выгрузить();
				// комплект
				Для Каждого СтрокаКомплекта Из ТЗКомплекта Цикл
					
					Если СтрокаКомплекта.Количество = 0 Тогда 
						Продолжить; 
					КонецЕсли; 
					
					НоваяСтрока = ДокОбъект.Комплектующие.Добавить();
					НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
					НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * ВыборкаНоменклатуры.Количество;
					НоваяСтрока.Продукция = ВыборкаНоменклатуры.Номенклатура;
					НоваяСтрока.КоличествоПродукции = ВыборкаНоменклатуры.Количество;
					
				КонецЦикла; 
			Иначе			
				// обычный товар
				НоваяСтрока = ДокОбъект.Комплектующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНоменклатуры);
				НоваяСтрока.Продукция = ВыборкаНоменклатуры.Номенклатура;
				НоваяСтрока.КоличествоПродукции = ВыборкаНоменклатуры.Количество;
			КонецЕсли;
			
		КонецЦикла;
		
		// Шворобей ВЮ 29.11.2022 ++
		ДокОбъект.ПостобработкаКомплектующих();
		// Шворобей ВЮ 29.11.2022 ++
	
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокОбъект.Разблокировать();
			СообщитьИзМодуля("" + ДокОбъект);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ДокОбъект.Ссылка;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////
//////// ПРОВЕРИТЬ!!! ПОКА НЕ ТАК РАБОТАЕТ ///////////////////////////////////////////////////////////

Функция ПодготовитьИсходныеДанныеДляЗаявкиНаПерепаковку(ДокСсылка, ПорогЗакрытия = 50000, НадоРазбивать = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", ДокСсылка.Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка КАК Ссылка,
	|	ИнетМагазиныСкладыПодсортировкиFBO.Склад КАК Склад,
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.РазбиватьПоЛимитуКоличество1 КАК НадоРазбивать,
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.ЛимитПоКоличеству1 КАК ПорогЗакрытия
	|ИЗ
	|	Справочник.ИнетМагазины.СкладыПодсортировкиFBO КАК ИнетМагазиныСкладыПодсортировкиFBO
	|ГДЕ
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.Контрагент = &Контрагент
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ.Количество() Тогда
		ПорогЗакрытия = ТЗ[0].ПорогЗакрытия;
		НадоРазбивать = ТЗ[0].НадоРазбивать;
		МассивСкладов = ТЗ.ВыгрузитьКолонку("Склад");
	Иначе
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("STC-60"));
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("Склад", МассивСкладов.Получить(0));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиТМЦОстатки.Склад, &Склад)) КАК Склад,
	|	СУММА(ЕСТЬNULL(Товары.Количество, 0)) КАК КоличествоИсх,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток,
	|	СУММА(ЕСТЬNULL(Товары.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0))) КАК НужноеКоличество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке <> 0
	|				ТОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|						ТОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) КАК ШтукВКоробке,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|				ТОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|						ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) КАК ШтукВКомплекте,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура) КАК КоличествоСтрочек,
	|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 1)) КАК Кратность,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке <> 0
	|				ТОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|						ТОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура) / МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 1)) КАК КратностьКоробаСпайки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке <> 0
	|				ТОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|						ТОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура) / МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 1)) / МАКСИМУМ(ВЫБОР
	|			КОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|				ТОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|						ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоПоКратности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке <> 0
	|				ТОГДА Комплектующие.Номенклатура.Родитель.ШтукВКоробке
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|						ТОГДА Комплектующие.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура) / МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 1)) / МАКСИМУМ(ВЫБОР
	|			КОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|				ТОГДА Товары.Номенклатура.Родитель.ШтукВКомплекте
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|						ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|		ПО Товары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад В (&МассивСкладов)) КАК РезервыТМЦОстатки
	|		ПО Товары.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|		ПО Товары.Номенклатура = Комплектующие.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	И Товары.Количество > 0
	|	И ЕСТЬNULL(Товары.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) > 0
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ.Количество() = 0 Тогда Возврат Ложь; КонецЕсли;
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТоваров ИЗ ТЗ Цикл
		
		//////////////////////////// ВНАЧАЛЕ ИЗБАВИМСЯ ОТ ДРОБНЫХ ЧИСЕЛ //////////////////////////////
		Если НЕ ПроверкаЧислаНаЦелое(СтрокаТоваров.КоличествоПоКратности) Тогда
			СтрокаТоваров.КоличествоПоКратности = Цел(СтрокаТоваров.КоличествоПоКратности) + 1;
			СтрокаТоваров.Количество = СтрокаТоваров.КоличествоПоКратности;
			СтрокаТоваров.КратностьКоробаСпайки = СтрокаТоваров.Количество * СтрокаТоваров.ШтукВКомплекте;
		КонецЕсли;
		
		///////////////////////// ТЕПЕРЬ УЗНАЕМ, СКОЛЬКО НУЖНО СПАЕК /////////////////////////////////
		Если СтрокаТоваров.НужноеКоличество > СтрокаТоваров.КоличествоПоКратности Тогда
			Если СтрокаТоваров.НужноеКоличество % СтрокаТоваров.КоличествоПоКратности <> 0 Тогда
				СтрокаТоваров.Количество = ОКРУГЛТ(СтрокаТоваров.НужноеКоличество, СтрокаТоваров.КоличествоПоКратности) + СтрокаТоваров.КоличествоПоКратности;
			Иначе
				СтрокаТоваров.Количество = СтрокаТоваров.НужноеКоличество;
			КонецЕсли;
			СтрокаТоваров.КратностьКоробаСпайки = СтрокаТоваров.Количество * СтрокаТоваров.ШтукВКомплекте;
		КонецЕсли;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	НадоРазбивать = ТЗ.Итог("КратностьКоробаСпайки") > ПорогЗакрытия;
	
	Если НЕ НадоРазбивать Тогда
		
		ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку");
		
		Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
			ДокЗаявка.ДокОснование = ДокСсылка;
		КонецЕсли;
		
		ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, ТЗ);
		
	Иначе ////////////// НАДО РАЗБИВАТЬ //////////////////////////////////////////////////////////////
		
		БуфернаяТаблица = Новый ТаблицаЗначений;
		БуфернаяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		БуфернаяТаблица.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		БуфернаяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		БуфернаяТаблица.Колонки.Добавить("КратностьКоробаСпайки", Новый ОписаниеТипов("Число"));
		
		ТаблицаКЗагрузке = БуфернаяТаблица.СкопироватьКолонки();
		
		///////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТаблицаКЗагрузке.Очистить(); БуфернаяТаблица.Очистить();
		Для Каждого СтрокаТоваров ИЗ ТЗ Цикл
			
			НадоРаспределить = СтрокаТоваров.КратностьКоробаСпайки;
			
			Если НадоРаспределить <= ПорогЗакрытия - БуфернаяТаблица.Итог("КратностьКоробаСпайки") Тогда
				////////////////// ЗАПИХИВАЕМ В БУФЕРНУЮ ТАБЛИЦУ ////////////////////////////////////////////////////////////
				////////////////// СМОТРИМ, ТАМ ПУСТО ИЛИ УЖЕ ЧТО-ТО ЕСТЬ ///////////////////////////////////////////////////
				
				НоваяСтрока = БуфернаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
				
			Иначе ///////////// ЗДЕСЬ ПРИДЕТСЯ ДРОБИТЬ ///////////////////////////////////////////////////////////////////////
				/////////////// НАЙДЕМ КОЛИЧЕСТВО, СКОЛЬКО РАЗ БУДЕМ ДРОБИТЬ ОДИН ТОВАР //////////////////////////////////////
				
				////////////// ПРОВЕРИМ, РАЗДЕЛИТСЯ ЛИ НАЦЕЛО БЕЗ ОСТАТКА ////////////////////////////////////////////////////
				
				Если НадоРаспределить % ПорогЗакрытия = 0 Тогда
					КоличествоИтерацийДеления = Окр(НадоРаспределить / ПорогЗакрытия, 0, РежимОкругления.Окр15как10);
					ФлагПолностьюРазделилось = Истина;
				Иначе
					КоличествоИтерацийДеления = Окр(НадоРаспределить / ПорогЗакрытия, 0, РежимОкругления.Окр15как10) + 1;
					ФлагПолностьюРазделилось = Ложь;
				КонецЕсли;
				
				УжеРаспределено = 0;   // Считаем по Комплектующим
				Для й = 1 По КоличествоИтерацийДеления Цикл
					
					Если й < КоличествоИтерацийДеления Тогда  // ЕСЛИ НЕ ПОСЛЕДНЯЯ ИТЕРАЦИЯ, СОЗДАДИМ ЗАЯВКУ ПО ТОВАРУ
						
						ТаблицаКЗагрузке.Очистить();
						
						НоваяСтрока = ТаблицаКЗагрузке.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
						НоваяСтрока.Количество = Цел(ПорогЗакрытия / СтрокаТоваров.ШтукВКомплекте);
						УжеРаспределено = УжеРаспределено + СтрокаТоваров.КратностьКоробаСпайки;
						
						Если ТаблицаКЗагрузке.Количество() > 0 Тогда
							ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку",,,Истина);
							Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
								ДокЗаявка.ДокОснование = ДокСсылка;
							КонецЕсли;
							ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, ТаблицаКЗагрузке);
							Если ДокЗаявкаСсылка = Неопределено Тогда
								ОтменитьТранзакцию();
								Возврат Ложь;
							КонецЕсли;
							ТаблицаКЗагрузке.Очистить();
						КонецЕсли;
						
					ИначеЕсли й = КоличествоИтерацийДеления И ФлагПолностьюРазделилось Тогда
						////// ИТЕРАЦИЯ ПОСЛЕДНЯЯ, НО КОЛИЧЕСТВО РАЗДЕЛИЛОСЬ БЕЗ ОСТАТКА /////////////////////////////////////
						
						ТаблицаКЗагрузке.Очистить();
						
						// обычный товар
						НоваяСтрока = ТаблицаКЗагрузке.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
						НоваяСтрока.Количество = Цел(ПорогЗакрытия / СтрокаТоваров.ШтукВКомплекте);  // ???
						УжеРаспределено = УжеРаспределено + СтрокаТоваров.КратностьКоробаСпайки;
						
						Если ТаблицаКЗагрузке.Количество() > 0 Тогда
							ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку",,,Истина);
							Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
								ДокЗаявка.ДокОснование = ДокСсылка;
							КонецЕсли;
							ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, ТаблицаКЗагрузке);
							Если ДокЗаявкаСсылка = Неопределено Тогда
								ОтменитьТранзакцию();
								Возврат Ложь;
							КонецЕсли;
							ТаблицаКЗагрузке.Очистить();
						КонецЕсли;
						
					Иначе ////////////// ПОСЛЕДНЯЯ ИТЕРАЦИЯ И ЕСТЬ ОСТАТОК /////////////////////////////////////////////////////
						ОсталосьРаспределить = НадоРаспределить - УжеРаспределено;
						
						Если ОсталосьРаспределить <= 0 Тогда
							Продолжить;
						КонецЕсли;
						/////////////// НАДО ПОНЯТЬ, СМОЖЕМ МЫ ЗАПИХАТЬ В БУФЕРНУЮ ТАБЛИЦУ ИЛИ НЕТ //////////////////////////////
						ПоСколькоДробим = Окр(ОсталосьРаспределить / ?(СтрокаТоваров.ШтукВКомплекте = 0, 1, СтрокаТоваров.ШтукВКомплекте), 0, РежимОкругления.Окр15как10);
						
						ПомещаетсяВБуфернуюТаблицу = ОсталосьРаспределить < ПорогЗакрытия - БуфернаяТаблица.Итог("КратностьКоробаСпайки");
						
						Если НЕ ПомещаетсяВБуфернуюТаблицу Тогда
							/////////// НЕ ПОМЕЩАЕТСЯ В БУФЕРНУЮ ТАБЛИЦУ ////////////////////////////////////////////////////////
							///////// СКИДЫВАЕМ БУФЕР В ПЕРЕМЕЩЕНИЕ И ДЕЛАЕМ НОВУЮ БУФЕРНУЮ ТАБЛИЦУ /////////////////////////////
							/////////////////////////////////////////////////////////////////////////////////////////////////////
							
							Если БуфернаяТаблица.Количество() > 0 Тогда
								ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку",,,Истина);
								Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
									ДокЗаявка.ДокОснование = ДокСсылка;
								КонецЕсли;
								ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, БуфернаяТаблица);
								Если ДокЗаявкаСсылка = Неопределено Тогда
									ОтменитьТранзакцию();
									Возврат Ложь;
								КонецЕсли;
								БуфернаяТаблица.Очистить();
							КонецЕсли;
							
						КонецЕсли;
						
						НоваяСтрока = БуфернаяТаблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
						НоваяСтрока.Количество = ПоСколькоДробим;
						
					КонецЕсли;
					
				КонецЦикла;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаКЗагрузке.Количество() > 0 Тогда
			ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку",,,Истина);
			Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
				ДокЗаявка.ДокОснование = ДокСсылка;
			КонецЕсли;
			ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, ТаблицаКЗагрузке);
			Если ДокЗаявкаСсылка = Неопределено Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			ТаблицаКЗагрузке.Очистить();
		КонецЕсли;
		
		Если БуфернаяТаблица.Количество() > 0 Тогда
			ДокЗаявка = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ЗаявкаНаПерепаковку",,,Истина);
			Если НЕ ЗначениеЗаполнено(ДокЗаявка.ДокОснование) Тогда
				ДокЗаявка.ДокОснование = ДокСсылка;
			КонецЕсли;
			ДокЗаявкаСсылка = ЗаполнитьЗаявкуНаПерепаковку(ДокЗаявка, БуфернаяТаблица);
			Если ДокЗаявкаСсылка = Неопределено Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			БуфернаяТаблица.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

Функция ПроверкаЧислаНаЦелое(ВходящееЧисло) Экспорт

   Возврат ВходящееЧисло = Цел(ВходящееЧисло); //Возвращает Булево

КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СоздатьРазбивкуРНК_ПоВидуСпаек(ДокСсылка, РазбиватьПоМаркировке = Истина) Экспорт

	МассивВозврата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДокСсылка.Дата);
	
	ДополнительныеРеквизиты = Новый Структура;
	ДополнительныеРеквизиты.Вставить("ОтсрочкаПлатежа", ДокСсылка.Договор.ОтсрочкаПлатежа);
	//++Данилова Е.В. 30.09.2025 HELP-7048
	//ДополнительныеРеквизиты.Вставить("Подразделение", ДокСсылка.Контрагент.Менеджер.Подразделение);
	ДополнительныеРеквизиты.Вставить("Подразделение", ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(ДокСсылка.Контрагент.Менеджер));
	//--Данилова Е.В. 30.09.2025
	ДополнительныеРеквизиты.Вставить("Менеджер", ДокСсылка.Контрагент.Менеджер);
	ДополнительныеРеквизиты.Вставить("КодОперации", Перечисления.КодыОперацийОстатки.Комиссия);
	ДополнительныеРеквизиты.Вставить("Склад", Справочники.Склады.НайтиПоКоду("STC-60"));
	ДополнительныеРеквизиты.Вставить("СостояниеНакладной", Перечисления.СостоянияНакладной.ВРаботе);
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
	ДополнительныеРеквизиты.Вставить("ДатаОтгрузки", Дата(1,1,1));
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
	//ДополнительныеРеквизиты.Вставить("Комментарий", "");
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	
	// Шворобей ВЮ 24.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3300
	ТекстСпайки = "Это спайки";
	ТекстНеСпайки = "Это не спайки";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", ДокСсылка.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И Номенклатура.Родитель.ТоварнаяГруппаВерхнегоУровня
	|			ТОГДА Номенклатура.Родитель
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						И Номенклатура.Родитель.Родитель.ТоварнаяГруппаВерхнегоУровня
	|					ТОГДА Номенклатура.Родитель.Родитель
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Номенклатура.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|								И Номенклатура.Родитель.Родитель.Родитель.ТоварнаяГруппаВерхнегоУровня
	|							ТОГДА Номенклатура.Родитель.Родитель.Родитель
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|										И Номенклатура.Родитель.Родитель.Родитель.Родитель.ТоварнаяГруппаВерхнегоУровня
	|									ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|												И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ТоварнаяГруппаВерхнегоУровня
	|											ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель
	|										ИНАЧЕ ВЫБОР
	|												КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|														И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТоварнаяГруппаВерхнегоУровня
	|													ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
	|												ИНАЧЕ ""Не установлен""
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ГруппаТовараВерхнегоУровня
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивНоменклатуры)";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	НазваниеГруппыТовара = "";
	
	Если Результат.Следующий() Тогда 
    	НазваниеГруппыТовара = Строка(Результат.ГруппаТовараВерхнегоУровня); //Это и есть верхний уровень! 
	КонецЕсли; 	
	// Шворобей ВЮ 24.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3300
	
	Если РазбиватьПоМаркировке Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.КОтгрузке, 0) КАК Количество,
		|	ВЫБОР
		|		КОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОбязательнойМаркировки,
		|	ВЫБОР
		|		КОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаМаркировки
		|ПОМЕСТИТЬ ТаблицаСпайки
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка
		|	И Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|	И Товары.КОтгрузке > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.КОтгрузке, 0) КАК Количество,
		|	ВЫБОР
		|		КОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОбязательнойМаркировки,
		|	ВЫБОР
		|		КОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаМаркировки
		|ПОМЕСТИТЬ ТаблицаНеСпайки
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка
		|	И Товары.Номенклатура.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|	И Товары.КОтгрузке > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСпайки.Номенклатура КАК Номенклатура,
		|	ТаблицаСпайки.Количество КАК Количество,
		|	ТаблицаСпайки.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки,
		|	ТаблицаСпайки.ДатаМаркировки КАК ДатаМаркировки
		|ПОМЕСТИТЬ СпайкиНемаркированныйТовар
		|ИЗ
		|	ТаблицаСпайки КАК ТаблицаСпайки
		|ГДЕ
		|	ТаблицаСпайки.Количество > 0
		|	И (ТаблицаСпайки.ДатаМаркировки = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ТаблицаСпайки.ДатаМаркировки > &ДатаОтгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСпайки.Номенклатура КАК Номенклатура,
		|	ТаблицаСпайки.Количество КАК Количество,
		|	ТаблицаСпайки.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки,
		|	ТаблицаСпайки.ДатаМаркировки КАК ДатаМаркировки
		|ПОМЕСТИТЬ СпайкиМаркированныйТовар
		|ИЗ
		|	ТаблицаСпайки КАК ТаблицаСпайки
		|ГДЕ
		|	ТаблицаСпайки.Количество > 0
		|	И ТаблицаСпайки.ДатаМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаСпайки.ДатаМаркировки <= &ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНеСпайки.Номенклатура КАК Номенклатура,
		|	ТаблицаНеСпайки.Количество КАК Количество,
		|	ТаблицаНеСпайки.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки,
		|	ТаблицаНеСпайки.ДатаМаркировки КАК ДатаМаркировки
		|ПОМЕСТИТЬ НеСпайкиНемаркированныйТовар
		|ИЗ
		|	ТаблицаНеСпайки КАК ТаблицаНеСпайки
		|ГДЕ
		|	ТаблицаНеСпайки.Количество > 0
		|	И (ТаблицаНеСпайки.ДатаМаркировки = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ТаблицаНеСпайки.ДатаМаркировки > &ДатаОтгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНеСпайки.Номенклатура КАК Номенклатура,
		|	ТаблицаНеСпайки.Количество КАК Количество,
		|	ТаблицаНеСпайки.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки,
		|	ТаблицаНеСпайки.ДатаМаркировки КАК ДатаМаркировки
		|ПОМЕСТИТЬ НеСпайкиМаркированныйТовар
		|ИЗ
		|	ТаблицаНеСпайки КАК ТаблицаНеСпайки
		|ГДЕ
		|	ТаблицаНеСпайки.Количество > 0
		|	И ТаблицаНеСпайки.ДатаМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТаблицаНеСпайки.ДатаМаркировки <= &ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Товары.Номенклатура) КАК КоличествоТоваров
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка";
		
		УстановитьПривилегированныйРежим(Истина);
		МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		УстановитьПривилегированныйРежим(Ложь);
		
		СпайкиНемаркированныйТовар = МассивПакета[2].Выгрузить();
		
		// "Это спайки, немаркированный товар"
		
		Если СпайкиНемаркированныйТовар.Количество() > 0 Тогда
			РНК_Спайки_НемаркированныйТовар = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, СпайкиНемаркированныйТовар, ДополнительныеРеквизиты,, ТекстСпайки + " " + НазваниеГруппыТовара, Истина, Истина, Истина, Истина);		 
			Если РНК_Спайки_НемаркированныйТовар <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_Спайки_НемаркированныйТовар);
			КонецЕсли;
		КонецЕсли;
		
		СпайкиМаркированныйТовар = МассивПакета[3].Выгрузить();
		
		// "Это спайки, маркированный товар"
		
		Если СпайкиМаркированныйТовар.Количество() > 0 Тогда
			РНК_Спайки_МаркированныйТовар = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, СпайкиМаркированныйТовар, ДополнительныеРеквизиты,, ТекстСпайки + " " + НазваниеГруппыТовара, Истина, Истина, Истина, Истина);		 
			Если РНК_Спайки_МаркированныйТовар <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_Спайки_МаркированныйТовар);
			КонецЕсли;
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////////////////////
		
		НеСпайкиНемаркированныйТовар = МассивПакета[4].Выгрузить();
		
		// "Это не спайки, немаркированный товар"
		
		Если НеСпайкиНемаркированныйТовар.Количество() > 0 Тогда
			РНК_НеСпайки_НемаркированныйТовар = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, НеСпайкиНемаркированныйТовар, ДополнительныеРеквизиты,, ТекстНеСпайки + " " + НазваниеГруппыТовара, Ложь, Истина, Истина, Истина);	 
			Если РНК_НеСпайки_НемаркированныйТовар <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_НеСпайки_НемаркированныйТовар);	
			КонецЕсли;
		КонецЕсли;
		
		НеСпайкиМаркированныйТовар = МассивПакета[5].Выгрузить();
		
		// "Это не спайки, маркированный товар"
		
		Если НеСпайкиМаркированныйТовар.Количество() > 0 Тогда
			РНК_НеСпайки_МаркированныйТовар = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, НеСпайкиМаркированныйТовар, ДополнительныеРеквизиты,, ТекстНеСпайки + " " + НазваниеГруппыТовара, Ложь, Истина, Истина, Истина);	 
			Если РНК_НеСпайки_МаркированныйТовар <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_НеСпайки_МаркированныйТовар);	
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.КОтгрузке, 0) КАК Количество
		|ПОМЕСТИТЬ ТаблицаСпайки
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка
		|	И Товары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|	И Товары.КОтгрузке > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.КОтгрузке, 0) КАК Количество
		|ПОМЕСТИТЬ ТаблицаНеСпайки
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка
		|	И Товары.Номенклатура.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|	И Товары.КОтгрузке > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Товары.Номенклатура) КАК КоличествоТоваров
		|ИЗ
		|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка";
		
		УстановитьПривилегированныйРежим(Истина);
		МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		УстановитьПривилегированныйРежим(Ложь);
		
		ТаблицаСпайки = МассивПакета[0].Выгрузить();
		
		// "Это спайки"
		
		Если ТаблицаСпайки.Количество() > 0 Тогда
			РНК_Спайки = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, ТаблицаСпайки, ДополнительныеРеквизиты,, ТекстСпайки + " " + НазваниеГруппыТовара, Истина, Истина, Истина, Истина);		 
			Если РНК_Спайки <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_Спайки);
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаНеСпайки = МассивПакета[1].Выгрузить();
		
		// "Это не спайки" 
		
		Если ТаблицаНеСпайки.Количество() > 0 Тогда
			РНК_НеСпайки = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(ДокСсылка, ТаблицаНеСпайки, ДополнительныеРеквизиты,, ТекстНеСпайки + " " + НазваниеГруппыТовара, Ложь, Истина, Истина, Истина);	 
			Если РНК_НеСпайки <> Неопределено Тогда
				МассивВозврата.Добавить(РНК_НеСпайки);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Кухарь А.Ю. 26.03.2025 начало
	// Пустая задача
	
	ЛимПоз=5000;
	Попытка
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИнетМагазины.РазбиватьПоЛимитуКоличество1 КАК РазбиватьПоЛимитуКоличество1,
		|	ИнетМагазины.ЛимитПоКоличеству1 КАК ЛимитПоКоличеству1
		|ИЗ
		|	Справочник.ИнетМагазины КАК ИнетМагазины
		|ГДЕ
		|	ИнетМагазины.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", ДокСсылка.Контрагент);
		ТЗ=Запрос.Выполнить().Выбрать();
		Если ТЗ.Следующий() Тогда
			ЕстьРаздел=ТЗ.РазбиватьПоЛимитуКоличество1;
			Если ЕстьРаздел Тогда
				ЛимПоз=ТЗ.ЛимитПоКоличеству1;
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;

	КоличествоМассива=МассивВозврата.Количество();
	НачатьТранзакцию();
	Для сч=1 по КоличествоМассива цикл
		РНК=МассивВозврата.Получить(сч-1);
		если не ТранзакцияАктивна() тогда
			НачатьТранзакцию();
		КонецЕсли;
		Попытка
			ВыделитьКоличествоИзНакладной(РНК,ЛимПоз,МассивВозврата);
		Исключение
			Сообщить(ОписаниеОшибки());
			ОткатыватьТранзацию=Истина;
			если ТранзакцияАктивна() тогда
				ОтменитьТранзакцию();
				Прервать;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	// Кухарь А.Ю. 26.03.2025 конец
	
	
	Возврат МассивВозврата;
	
КонецФункции


// Кухарь А.Ю. 26.03.2025 начало

Процедура ВыделитьКоличествоИзНакладной(Знач РНК,Лимит,МассивДокументов) экспорт

	РНКСтарая=РНК.ПолучитьОбъект();
	ПараметрыСеанса.ЗапущенаОбработка=Истина;
	
	ТаблицаТоваровДляНовойРНК=РНКСтарая.Товары.Выгрузить();
	ТаблицаТоваровДляНовойРНК.Очистить();
	ВремТЗ=ТаблицаТоваровДляНовойРНК.Скопировать();
	
	для каждого СтрТЧ из РНКСтарая.Товары цикл
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		Коэффициент=СтрТЧ.КоличествоКомплектующих/СтрТЧ.Количество;
		если СтрТЧ.КоличествоКомплектующих> Лимит тогда
			КоличествоПорций=СтрТЧ.КоличествоКомплектующих/Лимит;
			если Цел(КоличествоПорций)<>КоличествоПорций тогда
				КоличествоПорций=Цел(КоличествоПорций)+1;
			КонецЕсли;	
			ОсталосьРаспределить=СтрТЧ.КоличествоКомплектующих;
			пока ОсталосьРаспределить>0 цикл
				СтрокаТаблицы=ТаблицаТоваровДляНовойРНК.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрТЧ);	
				СтрокаТаблицы.КоличествоКомплектующих=Мин(Лимит,ОсталосьРаспределить);
				СтрокаТаблицы.Количество=СтрокаТаблицы.КоличествоКомплектующих/Коэффициент;
				ОсталосьРаспределить=ОсталосьРаспределить-Лимит;
			КонецЦикла;
		иначе
			СтрокаТаблицы=ТаблицаТоваровДляНовойРНК.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрТЧ);		
		КонецЕсли;
		
	КонецЦикла;	
	
	ТаблицаТоваровДляНовойРНК.Сортировать("Количество Убыв");
	ТекущееКоличество=0;
	сч=1;
	ЛимитЭтойНакладнойВыбран=ложь;
	
	КоличествоСТрок=ТаблицаТоваровДляНовойРНК.Количество();
	для каждого СтрТЗ из ТаблицаТоваровДляНовойРНК цикл
		Коэффициент=СтрТЗ.КоличествоКомплектующих/СтрТЗ.Количество;

		если сч=КоличествоСтрок  тогда  
			ВремСтр=ВремТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
			ВремСтр.Количество=СтрТЗ.количество;				
			СоздатьРНКНаВыделяемоеКоличество(ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			Продолжить;;
		КонецЕсли;
		
		если СтрТЗ.КоличествоКомплектующих = Лимит тогда
			ВремСтр=ВремТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
			ВремСтр.Количество=СтрТЗ.количество;			
			СоздатьРНКНаВыделяемоеКоличество (ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			ВремТЗ.Очистить();
			ЛимитЭтойНакладнойВыбран=Истина;
			сч=сч+1;
			Продолжить;
		КонецЕсли;
		ВремСтр=ВремТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
		
		ТекущееКоличество=ТекущееКоличество+СтрТЗ.КоличествоКомплектующих;
		БудущееКоличество=ТекущееКоличество+ТаблицаТоваровДляНовойРНК.Получить(сч).КоличествоКомплектующих;
		если БудущееКоличество>Лимит тогда
			СоздатьРНКНаВыделяемоеКоличество(ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			ВремТЗ.Очистить();
			ЛимитЭтойНакладнойВыбран=Истина;
			ТекущееКоличество=0;
		КонецЕсли;	
		
		сч=сч+1;	
	КонецЦикла;
	//ЗафиксироватьТранзакцию();
	ПараметрыСеанса.ЗапущенаОбработка=Ложь;

КонецПроцедуры

Процедура СоздатьРНКНаВыделяемоеКоличество (ТаблицаТоваровДляНовойРНК, ИспользоватьСтаруюРНК,РНК,МассивДокументов) экспорт
	
	если ИспользоватьСтаруюРНК тогда
		РНКНовая=РНК.ПолучитьОбъект();
	иначе
		РНКНовая=документы.РасходнаяНакладная.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(РНКНовая,РНК,,"Номер");
		РНКНовая.Дата=ТекущаяДата();
		УстановитьНомерДокументаКлиентСервер(РНКНовая); 
		
		РНКНовая.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	КонецЕсли;
	РНКНовая.Товары.Загрузить(ТаблицаТоваровДляНовойРНК);
	для каждого СтрТЧ из РНКНовая.Товары цикл
		РассчитатьСуммуТабЧасти(СтрТЧ, РНКНовая);
	КонецЦикла;

	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(РНКНовая); 
	МаркировкаКС.ЗаполнитьТабличныеЧастиПризнакомМаркировки(РНКНовая);	
	РНКНовая.Записать(РежимЗаписиДокумента.Запись);
	если не ИспользоватьСтаруюРНК тогда
		МассивДокументов.добавить(РНКНовая.Ссылка);
	КонецЕсли;
	Сообщить(""+РНКНовая);
КонецПроцедуры
 
// Кухарь А.Ю. 26.03.2025 конец
